aaron-bond.better-comments
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-ssh
charliermarsh.ruff
christian-kohler.path-intellisense
eamodio.gitlens
ericsia.pythonsnippets3
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mhutchie.git-graph
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
oderwat.indent-rainbow
pkief.material-icon-theme
tomoki1207.pdf
usernamehw.errorlens
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
