aaron-bond.better-comments
anysphere.pyright
christian-kohler.path-intellisense
codezombiech.gitignore
davidanson.vscode-markdownlint
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
elazarcoh.simply-view-image-for-python-debugging
github.remotehub
github.vscode-pull-request-github
ionutvmi.path-autocomplete
jbockle.jbockle-format-files
jspolancor.presentationmode
kevinrose.vsc-python-indent
matangover.mypy
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
mutantdino.resourcemonitor
nabinkhair.vtheme
netanelgilad.git-patch-clipboard
niradler.kill-process
njpwerner.autodocstring
njqdev.vscode-python-typehint
oderwat.indent-rainbow
pkief.material-icon-theme
redhat.vscode-yaml
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
thomascsd.vscode-readme-pattern
tomoki1207.pdf
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wakatime.vscode-wakatime
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
zainchen.json
zhuangtongfa.material-theme
